class FoodData {
  static Map<String, Map<String, dynamic>> foods = {
    // ===== อาหารคาว =====
    "ข้าวไก่ทอด": {
      "price": 45,
      "lat": 18.293594051376818, 
      "lng": 99.49241065477393,
      "video": "assets/videos/YTDown.com_Shorts_Media__jzzvifTqwk_001_1080p.mp4",
      "ingredients": ["ข้าวสวย", "เนื้อไก่", "แป้งทอด", "น้ำมัน"],
      "steps": [
        "หมักไก่กับเครื่องปรุง",
        "คลุกแป้ง",
        "ทอดไก่ให้เหลืองกรอบ",
        "จัดเสิร์ฟพร้อมข้าว"
      ],
    },
    "ข้าวไข่ดาว": {
      "price": 35,
      "lat": 18.289177820421788,
      "lng": 99.50483412373441,
      "video": "assets/videos/YTDown.com_Shorts_Media_q26zyUiJ-cM_001_1080p.mp4",
      "ingredients": ["ข้าวสวย", "ไข่ไก่", "น้ำมัน"],
      "steps": [
        "ตั้งกระทะใส่น้ำมัน",
        "ทอดไข่ดาว",
        "ตักราดบนข้าว"
      ],
    },
    "ข้าวมันไก่": {
      "price": 45,
      "lat": 18.289374468363953,
      "lng": 99.48709941779241,
      "video": "assets/videos/YTDown.com_Shorts_Media_SCv8qgzfJVw_001_1080p.mp4",
      "ingredients": ["ข้าวมัน", "ไก่ต้ม", "น้ำจิ้มข้าวมันไก่", "แตงกวา"],
      "steps": [
        "ต้มไก่ให้สุก",
        "หุงข้าวมัน",
        "หั่นไก่",
        "จัดเสิร์ฟพร้อมน้ำจิ้ม"
      ],
    },
    "ข้าวไข่เจียว": {
      "price": 35,
      "lat": 18.294840228258053,
      "lng": 99.51171367571443,
      "video": "assets/videos/YTDown.com_Shorts_Media_MKL3x7wBETg_001_1080p.mp4",
      "ingredients": ["ข้าวสวย", "ไข่ไก่", "น้ำปลา", "น้ำมัน"],
      "steps": [
        "ตีไข่ใส่เครื่องปรุง",
        "ทอดไข่เจียวให้ฟู",
        "เสิร์ฟพร้อมข้าว"
      ],
    },

    // ===== ของหวาน =====
    "ช็อกโกแลต": {
      "price": 20,
      "lat": 18.292113294329603,
      "lng": 99.5000513353834,
      "video": "assets/videos/YTDown.com_Shorts_Media_0nf94ePEUIg_001_1080p.mp4",
      "ingredients": ["ผงโกโก้", "นม", "น้ำตาล"],
      "steps": [
        "ผสมโกโก้กับนม",
        "เติมน้ำตาล",
        "คนจนเข้ากัน"
      ],
    },
    "โดนัด": {
      "price": 25,
      "lat": 18.28300464947269,
      "lng": 99.50009160456645,
      "video": "assets/videos/YTDown.com_Shorts_Media_73qC4SYJFgw_001_1080p.mp4",
      "ingredients": ["แป้งสาลี", "น้ำตาล", "ยีสต์", "น้ำมัน"],
      "steps": [
        "นวดแป้ง",
        "พักแป้งให้ขึ้นฟู",
        "ทอดจนสุก",
        "โรยน้ำตาล"
      ],
    },
    "เยลลี่": {
      "price": 15,
      "lat": 18.799700787767847,
      "lng": 99.02301764425769,
      "video": "assets/videos/YTDown.com_YouTube_Media_iRaHYFN62eM_001_1080p.mp4",
      "ingredients": ["ผงเจลาติน", "น้ำหวาน", "น้ำ"],
      "steps": [
        "ผสมผงเจลาตินกับน้ำ",
        "ต้มให้ละลาย",
        "เทใส่พิมพ์",
        "แช่เย็นจนเซ็ตตัว"
      ],
    },
  };
}
